package section05;

/*
1번 분석하고 연습해보기

*
**
***
****
*****
******
*******

반복문 조건문 연습
 주말숙제 2중for문 코드 분석하기 
 
2번
   *
  **
 ***
****

3번
   *
  ***
 *****
******* 
  
4번
			
   *				
  ***				  
 *****				
*******		
 *****			 
  ***			 
   *			

   ☆
   *
  ***
 *****
******* 
  | | Merry Christmas~*
  
 
 구구단
  2 x 1 = 2		3 x 1 = 3	 4 x 1 = 4
  2 x 2 = 4
  ...
  2 x 9 = 18
  
  5 x 1 = 5 	6 x 1 = 6	 7 x 1 = 7
  ...
  5 x 9 = 45 	6 x ...
  
  8 x 1 = 1		9 x 1 = 9
  
  ....			9 x 9 = 81
  

 
 */

public class LoopHomeWork {

}
